Revit 2024 API
SpatialElementBoundarySubface.Valid Property
 Indicates if the subface instance is valid and can be used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool Valid { get; }
Visual Basic
Public ReadOnly Property Valid As Boolean
	Get
Visual C++
public:
property bool Valid {
	bool get ();
}
See Also
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace